'''
------------------------------------------------------------------------------------------------------------------------
                                               Полиморфизм
------------------------------------------------------------------------------------------------------------------------
'''

'''
------------------------------------------------------------------------------------------------------------------------
Полиморфизм - способность объектов разных классов по своему реагировать на одинаковые методы вызовов
------------------------------------------------------------------------------------------------------------------------
Это когда метод называется одинаково, но работает по разному для каждого класса
------------------------------------------------------------------------------------------------------------------------
'''

'''
------------------------------------------------------------------------------------------------------------------------
Пример без полиморфизма:
------------------------------------------------------------------------------------------------------------------------
'''
# class Telegram:
#     def send_message(self, text):
#         print(f'Send message to Telegram: {text}')
#
# class Email:
#     def send_email(self, text):
#         print(f'Send message to email: {text}')
#
# class SMS:
#     def send(self, text):
#         print(f'Send message to SMS: {text}')
'''
------------------------------------------------------------------------------------------------------------------------
Создаем clients, то есть набор классов через которых мы отправляем сообщения
Создается иначе, в списке передаем создание объекта класса, но без своих собственных переменных. 
Будет только 1 общая переменная для всех объектов - так можно делать)
------------------------------------------------------------------------------------------------------------------------
'''
# clients = [Telegram(), Email(), SMS()]
# for clint in clients:
#     clint.писать нечего
'''
------------------------------------------------------------------------------------------------------------------------
Так как у каждого класса методы называются по-разному - мы не можем в таком виде использовать цикл.
Придется вручную вызывать для каждого свой метод

Чтобы таким не заниматься и придумали полиморфизм:
Можно сделать одинаковые методы у каждого из классов и тогда они будут выполнять свои действия для каждого объекта класса
не смотря на то, что метод один и тот же
------------------------------------------------------------------------------------------------------------------------
'''
# class Telegram:
#     def send(self, text):
#         print(f'Send message to Telegram: {text}')
#
# class Email:
#     def send(self, text):
#         print(f'Send message to email: {text}')
#
# class SMS:
#     def send(self, text):
#         print(f'Send message to SMS: {text}')
#
# clients = [Telegram(), Email(), SMS()]
# for clint in clients:
#     clint.send('Текст для каждого объекта класса')
'''
------------------------------------------------------------------------------------------------------------------------
Здесь сработает полиморфизм и отправится отдельно:
Send message to Telegram: Текст для каждого объекта класса
Send message to email: Текст для каждого объекта класса
Send message to SMS: Текст для каждого объекта класса
------------------------------------------------------------------------------------------------------------------------
'''

'''
------------------------------------------------------------------------------------------------------------------------
Так же полиморфизм можно использовать при наследовании классов:
Каждый потомок будет переопределять метод и может через super() вызывать исходный метод родительского класса
------------------------------------------------------------------------------------------------------------------------
'''
# class Notification:
#     def send(self, text):
#         print(f'Send notification...')
#
# class PushNotification(Notification):
#     def send(self, text):
#         super().send(text)
#         print(f"Push: {text}")
#
# class SMSNotification(Notification):
#     def send(self, text):
#         super().send(text)
#         print(f"SMS: {text}")
#
#
# clients = [PushNotification(), SMSNotification()]
# for clint in clients:
#     clint.send('Текст для каждого объекта класса')


'''
------------------------------------------------------------------------------------------------------------------------
                                         Абстрактный метод
------------------------------------------------------------------------------------------------------------------------
Абстрактный метод - это своеобразный шаблон, чтобы мы могли обязать наследников реализовать какой-либо метод
Для этого надо импортировать из библиотеки abc модуль ABC с декоратором @abstractmethod

from abc import ABC, abstractmethod
class Sender(ABC):
    @abstractmethod
    def send(self, text):
        pass
        
Такая запись обязывает всех наследников так же создать метод def send(self, text) иначе будет ошибка
Ошибка появится при попытке создать объект класса, в котором мы не реализовали заданный абстрактный метод

При создании наследника сразу увидим подсказку от IDE - Class SMSSender must implement all abstract methods
------------------------------------------------------------------------------------------------------------------------
'''
# from abc import ABC, abstractmethod
# class Sender(ABC):
#     @abstractmethod
#     def send(self, text):
#         pass
#
# class SMSSender(Sender):
#     def __init__(self):
#         print("Init SMSSender")
#
# sms = SMSSender()

"""
Чтобы ошибки не было надо просто реализовать такой же метод
"""
from abc import ABC, abstractmethod
class Sender(ABC):
    @abstractmethod
    def send(self, text):
        pass

class SMSSender(Sender):
    def __init__(self):
        print("Init SMSSender")

    def send(self, text):
        pass

sms = SMSSender()





