'''
------------------------------------------------------------------------------------------------------------------------
                                        Множественное наследование
------------------------------------------------------------------------------------------------------------------------
'''
'''
------------------------------------------------------------------------------------------------------------------------
Множественное наследование это когда класс наследуется сразу от нескольких базовых классов
------------------------------------------------------------------------------------------------------------------------
'''

'''
------------------------------------------------------------------------------------------------------------------------
Например создаем класс товары с основными методами:
------------------------------------------------------------------------------------------------------------------------
'''
import datetime
class Goods:
    def __init__(self, name, weight, price):
        super().__init__()
        print('Init Goods')
        self.name = name
        self.weight = weight
        self.price = price
    def print_info(self):
        print(f"{self.name}, {self.price}, {self.weight}")
'''
------------------------------------------------------------------------------------------------------------------------
А так же класс mixin, который помогает добавлять вспомогательные методы к другим классам

Он не имеет собственных данных
Отдельно объект класса от него мы не создаем
Расширяет функционал 
------------------------------------------------------------------------------------------------------------------------
'''
class MixinLog:
    ID = 0
    def __init__(self):
        print('Init MixinLog')
        MixinLog.ID += 1
        self.id = MixinLog.ID

    def save_sell_log(self):
        print(f'{self.id} продан в {datetime.datetime.now().strftime("%Y-%m-%d %H:%M:%S")}')

'''
------------------------------------------------------------------------------------------------------------------------
Создаем класс, который будет наследовать оба класса созданных выше:
Класс который первый указан в скобках - первым инициализируется. До инициализации второго класса НЕ доходит

Поэтому в первой инициализации надо вызывать super().__init__() второго класса по порядку, чтобы ничего не ломалось
------------------------------------------------------------------------------------------------------------------------
'''
class Notebook(Goods, MixinLog):
    pass
n = Notebook('Acer', 1.5, 50_000)
n.print_info()
n.save_sell_log()

'''
------------------------------------------------------------------------------------------------------------------------
MRO - порядок поиска методов при множественном наследовании
------------------------------------------------------------------------------------------------------------------------
Есть специальный метод, который позволяет это увидеть - __mro__
------------------------------------------------------------------------------------------------------------------------
В нашем случае видим - (<class '__main__.Notebook'>, <class '__main__.Goods'>, <class '__main__.MixinLog'>, <class 'object'>)
Именно в таком порядке и происходит наследование:
Сначала от самого класса -> далее от класса который первый в скобках -> второй класс в скобках -> общий класс object

super() вызывает следующего в цепочке наследования
'''
print(Notebook.__mro__) # - (<class '__main__.Notebook'>, <class '__main__.Goods'>, <class '__main__.MixinLog'>, <class 'object'>)
