'''
------------------------------------------------------------------------------------------------------------------------
                                          Что такое исключения
------------------------------------------------------------------------------------------------------------------------
'''

'''
------------------------------------------------------------------------------------------------------------------------
Исключение - это ошибка которая возникла во время выполнения программы
Если ее не поймать и не обработать, тогда программа упадет и мы не сможем ничего сделать
Чтобы этого не произошло - надо использовать обработку исключения
------------------------------------------------------------------------------------------------------------------------
'''
try:
    pass
    '''Вызывается сам код, в котором может быть ошибка'''
except ValueError as a:
    pass
    '''Отлавливает саму ошибку - в нашем случае ValueError'''
except TypeError as a:
    pass
    '''Отлавливает ошибку - TypeError'''
else:
    pass
    '''Выполнится если ошибок в трае нет (не попало в except)'''
finally:
    pass
    '''Выполняется всегда, если не было raise или return 
    (то есть если на этапах выше где-то был raise/return то код на этих словах и закончится'''
'''
------------------------------------------------------------------------------------------------------------------------
Пример на основе API
------------------------------------------------------------------------------------------------------------------------
'''
import requests

BASE_URL = 'http://api.hh.ru'
def get_vacancies(base_url):
    try:
        response = requests.get(f'{base_url}/vacancies')
        response.raise_for_status()
        response_json = response.json()
    except requests.exceptions.HTTPError as e:
        print(f'Возникла ошибка: {e}')
    except ValueError:
        print(f'Не удалось получить json')
    else:
        try:
            resp_for_return = response_json['items']
        except:
            pass
        else:
            return response_json

resp = get_vacancies(BASE_URL)
print(resp)

'''
------------------------------------------------------------------------------------------------------------------------
Варианты ошибок:
------------------------------------------------------------------------------------------------------------------------
Все ошибки наследуются от BaseException
------------------------------------------------------------------------------------------------------------------------
Самые популярные:
1. ValueError, TypeError - неверные данные/типы
2. IndexError, KeyError - не нашли индекс/ключ
3. FileNotFoundError, PermissionError - файловые операции/нет доступа
4. requests-исключения - Timeout, ConnectionError, HTTPError 
5. KeyboardInterrupt - когда руками останавливаем программу
'''
