"""
------------------------------------------------------------------------------------------------------------------------
                                               Assert
------------------------------------------------------------------------------------------------------------------------
"""
"""
------------------------------------------------------------------------------------------------------------------------
assert — это оператор в Python для проверки условий во время выполнения программы.
Если условие ложное, программа падает с ошибкой.
------------------------------------------------------------------------------------------------------------------------
🔹Синтаксис
assert условие
или с сообщением:
assert условие, "сообщение об ошибке"
------------------------------------------------------------------------------------------------------------------------
"""
# def avg(lst: list):
#     assert len(lst) > 0, (                         # - пишем ассерт по условию что список не должен быть пустым
#         'Список не имеет элементов,\n'             # - а тут коммент после того как упадет ошибка по ассерту
#         'для вычисления среднего значения\n'
#         f'Переданный список: {lst}'
#     )
#     return round(sum(lst) / len(lst), 2)
# lst = [12, 34, 556]
# lst_2 = []
# print(avg(lst))
# print(avg(lst_2))

resp = {'balance': 200, 'token': 'sdfsiudhfsowecs'}
def chek_token(respons):
    assert 'token' in respons, 'Токен отсутствует в ответе от сервера'

resp_1 = {'balance': 200, 'word': 'sdfsiudhfsowecs'}
chek_token(resp_1)



