'''
------------------------------------------------------------------------------------------------------------------------
                                         Магический метод __call__
------------------------------------------------------------------------------------------------------------------------
'''

"""
------------------------------------------------------------------------------------------------------------------------
__call__ — кратко - делает объект вызываемым как функцию
obj()  →  obj.__call__()
------------------------------------------------------------------------------------------------------------------------
Синтаксис
class A:
    def __call__(self, *args, **kwargs):
        ...
------------------------------------------------------------------------------------------------------------------------
Пример
class A:
    def __call__(self, x):
        return x * 2
a = A()
a(5)  # 10
------------------------------------------------------------------------------------------------------------------------
Зачем нужен:
объект с состоянием + поведение как у функции

Пример с состоянием
class Counter:
    def __init__(self):
        self.count = 0

    def __call__(self):
        self.count += 1
        return self.count
c = Counter()
c()  # 1
c()  # 2
------------------------------------------------------------------------------------------------------------------------
Запомнить
👉 __call__ = “сделать объект функцией”
------------------------------------------------------------------------------------------------------------------------
"""
# class Test:
#     pass
# Test() # - Когда мы вызываем класс, то на самом деле под капотом происходит:
# Test.__call__() # - вот такой вызов магического метода __call__

'''
Пример с счетчиком на добавление товаров в корзину:
'''
# class AddToCartCount:
#     def __init__(self):
#         self.count = 0
#     def __call__(self, product_name):
#         self.count += 1
#         print(f"Продукт {product_name} добавлен в корзину\nВсего товаров: {self.count}")
#         return self.count
#
# add_to_cart = AddToCartCount()
#
# def test_add_products():
#     add_to_cart('Ноутбук')
#     add_to_cart('Наушники')
#     add_to_cart('Мышка')
#     assert add_to_cart.count == 3, ('Неверное количество товаров в корзине\n'
#                                     f'Ожидаемое количество: 4\n'
#                                     f'Фактический результат {add_to_cart.count}'
#                                     )
# test_add_products()

"""
Пример с проверкой статуса ответа от сервера:
"""
class Status:
    def __init__(self, code):
        self.code = code
    def __call__(self, response_code):
        if response_code == self.code:
            print(f'Статус код совпадает с ожидаемым: {self.code}')
            return True
        else:
            print(f'Статус код: {response_code} не совпадает с ожидаемым: {self.code}')
            return False

is_ok = Status(200)
assert is_ok(200)
assert is_ok(404)